jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32L475/FS_NOR_HW_SPIFI_STM32L475_ST_DiscoveryKit_IoT_Node.c
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    StatusQSPI = QUADSPI_SR;
    StatusDMA  = DMA2_ISR;
    if ((StatusDMA & (1uL << ISR_TEIF7_BIT)) != 0u) {
      break;                                              // Error, could not transfer data via DMA.
    }
    if ((StatusQSPI & (1uL << SR_TEF_BIT)) != 0) {
      break;                                              // Error, invalid address.
    }
    if ((StatusQSPI & (1uL << SR_TOF_BIT)) != 0) {
      break;                                              // Error, a timeout occurred.
    }
    if ((StatusDMA & (1uL << ISR_TCIF7_BIT)) != 0) {
      r = 0;                                              // OK, data transferred.
      break;
    }
    if (--TimeOut == 0) {
      break;                                              // Error, a timeout occurred.
    }
  }
#endif // FS_NOR_HW_USE_OS
  if (r != 0) {
    DMA2_CCR7 = 0;                                        // Stop the data transfer in case of an error.
    while ((DMA2_CCR7 & (1uL << DCCR_EN_BIT)) != 0u) {    // Wait for the stream to switch off
      ;
    }
  }
  QUADSPI_CR &= ~((1uL            << CR_DMAEN_BIT) |      // Disable the data transfer via DMA in QSPI controller and reset the FIFO threshold.
                  (CR_FTHRES_MASK << CR_FTHRES_BIT));
  return r;
}

/*********************************************************************
*
*      _IsDataAligned
*/
static int _IsDataAligned(const void * pData, U32 NumBytes) {
  if ((((U32)pData & 3u) == 0u) && ((NumBytes & 3u) == 0u)) {
    return 1;
  }
  return 0;
}

#endif // FS_NOR_HW_USE_DMA

#if FS_NOR_HW_USE_OS

/*********************************************************************
*
*       QUADSPI_IRQHandler
*/
void QUADSPI_IRQHandler(void);
void QUADSPI_IRQHandler(void) {
  OS_EnterInterrupt();

  _StatusQSPI |= QUADSPI_SR;
  QUADSPI_FCR = 0                    // Prevent other interrupts from occurring.
              | (1uL << SR_SMF_BIT)
              | (1uL << SR_TOF_BIT)
              | (1uL << SR_FTF_BIT)
              | (1uL << SR_TCF_BIT)
              | (1uL << SR_TEF_BIT)
              ;
  FS_X_OS_Signal();
  OS_LeaveInterrupt();
}

#if FS_NOR_HW_USE_DMA

/*********************************************************************
*
*       DMA2_Channel7_IRQHandler
*/
void DMA2_Channel7_IRQHandler(void);
void DMA2_Channel7_IRQHandler(void) {
  U32 Status;

  OS_EnterNestableInterrupt();
  Status      = DMA2_ISR;
  Status     &= 0               // Make sure that we clear only the flags assigned to the DMA stream we use.
             | (1uL << IFCR_CGIF7_BIT)
             | (1uL << IFCR_CTCIF7_BIT)
             | (1uL << IFCR_CHTIF7_BIT)
             | (1uL << IFCR_CTEIF7_BIT)
             ;
  DMA2_IFCR   = Status;         // Clear pending interrupt flags.
  _StatusDMA |= Status;         // Save the status to a static variable and check it in the task.
  FS_X_OS_Signal();             // Wake up the task.
  OS_LeaveNestableInterrupt();
}

#endif // FS_NOR_HW_USE_DMA

#endif // FS_NOR_HW_USE_OS

/*********************************************************************
*
*      Public code (via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    HW layer function. It is called before any other function of the physical layer.
*    It should configure the HW so that the other functions can access the NOR flash.
*
*  Return value
*    Frequency of the SPI clock in Hz.
*
*  Notes
*    (1) We do not enable the timeout for the deactivation of the CS signal
*        because of the silicon limitation 2.6.3 "Memory-mapped read operations
*        may fail when timeout counter is enabled" that is documented in [2]
*/
static int _HW_Init(U8 Unit) {
  U32 Div;
  U32 Freq_Hz;

  FS_USE_PARA(Unit);
  //
  // Enable the clocks of peripherals and reset them.
  //
  RCC_AHB2ENR  |= 0
               | (1uL << AHB2ENR_GPIOEEN)
               ;
  RCC_AHB3ENR  |=  (1uL << AHB3ENR_QSPIEN);
  RCC_AHB3RSTR |=  (1uL << AHB3ENR_QSPIEN);
  RCC_AHB3RSTR &= ~(1uL << AHB3ENR_QSPIEN);
#if FS_NOR_HW_USE_DMA
  RCC_AHB1ENR  |= 0
               | (1uL << AHB1ENR_DMA2EN)
               ;
#endif
  //
  // Wait for the unit to exit reset.
  //
  for (;;) {
    if ((RCC_AHB3RSTR & (1uL << AHB3ENR_QSPIEN)) == 0) {
      break;
    }
  }
  //
  // NCS is an output signal and is controlled by the QUADSPI unit.
  //
  GPIOE_MODER   &= ~(MODER_MASK   << ( NOR_NCS_BIT      << 1));
  GPIOE_MODER   |=  (MODER_ALT    << ( NOR_NCS_BIT      << 1));
  GPIOE_AFRH    &= ~(AFR_MASK     << ((NOR_NCS_BIT - 8) << 2));
  GPIOE_AFRH    |=  (0xAuL        << ((NOR_NCS_BIT - 8) << 2));
  GPIOE_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_NCS_BIT      << 1));
  GPIOE_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_NCS_BIT      << 1));
  //
  // CLK is an output signal controlled by the QUADSPI unit.
  //
  GPIOE_MODER   &= ~(MODER_MASK   << ( NOR_CLK_BIT      << 1));
  GPIOE_MODER   |=  (MODER_ALT    << ( NOR_CLK_BIT      << 1));
  GPIOE_AFRH    &= ~(AFR_MASK     << ((NOR_CLK_BIT - 8) << 2));
  GPIOE_AFRH    |=  (0xAuL        << ((NOR_CLK_BIT - 8) << 2));
  GPIOE_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CLK_BIT      << 1));
  GPIOE_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CLK_BIT      << 1));
  //
  // D0 is an input/output signal controlled by the QUADSPI unit.
  //
  GPIOE_MODER   &= ~(MODER_MASK   << ( NOR_D0_BIT      << 1));
  GPIOE_MODER   |=  (MODER_ALT    << ( NOR_D0_BIT      << 1));
  GPIOE_AFRH    &= ~(AFR_MASK     << ((NOR_D0_BIT - 8) << 2));
  GPIOE_AFRH    |=  (0xAuL        << ((NOR_D0_BIT - 8) << 2));
  GPIOE_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D0_BIT      << 1));
  GPIOE_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D0_BIT      << 1));
  //
  // D1 is an input/output signal controlled by the QUADSPI unit.
  //
  GPIOE_MODER   &= ~(MODER_MASK   << ( NOR_D1_BIT      << 1));
  GPIOE_MODER   |=  (MODER_ALT    << ( NOR_D1_BIT      << 1));
  GPIOE_AFRH    &= ~(AFR_MASK     << ((NOR_D1_BIT - 8) << 2));
  GPIOE_AFRH    |=  (0xAuL        << ((NOR_D1_BIT - 8) << 2));
  GPIOE_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D1_BIT      << 1));
  GPIOE_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D1_BIT      << 1));
  //
  // D2 is an input/output signal and is controlled by the QUADSPI unit.
  //
  GPIOE_MODER   &= ~(MODER_MASK   << ( NOR_D2_BIT      << 1));
  GPIOE_MODER   |=  (MODER_ALT    << ( NOR_D2_BIT      << 1));
  GPIOE_AFRH    &= ~(AFR_MASK     << ((NOR_D2_BIT - 8) << 2));
  GPIOE_AFRH    |=  (0xAuL        << ((NOR_D2_BIT - 8) << 2));
  GPIOE_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D2_BIT      << 1));
  GPIOE_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D2_BIT      << 1));
  //
  // D3 is an output signal and is controlled by the QUADSPI unit.
  //
  GPIOE_MODER   &= ~(MODER_MASK   << ( NOR_D3_BIT      << 1));
  GPIOE_MODER   |=  (MODER_ALT    << ( NOR_D3_BIT      << 1));
  GPIOE_AFRH    &= ~(AFR_MASK     << ((NOR_D3_BIT - 8) << 2));
  GPIOE_AFRH    |=  (0xAuL        << ((NOR_D3_BIT - 8) << 2));
  GPIOE_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D3_BIT      << 1));
  GPIOE_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D3_BIT      << 1));
#if FS_NOR_HW_USE_OS
  //
  // Disable the interrupt and configure the priority.
  //
  NVIC_DisableIRQ(QUADSPI_IRQn);
  NVIC_SetPriority(QUADSPI_IRQn, QUADSPI_PRIO);
#if FS_NOR_HW_USE_DMA
  NVIC_DisableIRQ(DMA2_Channel7_IRQn);
  NVIC_SetPriority(DMA2_Channel7_IRQn, DMA2_PRIO);
#endif // FS_NOR_HW_USE_DMA
#endif
  //
  // Initialize the Quad-SPI controller.
  //
  Freq_Hz = FS_NOR_HW_NOR_CLK_HZ;
  Div = _CalcClockDivider(&Freq_Hz);
  QUADSPI_CR   = 0                                    // Note 1
               | (1uL << CR_EN_BIT)                   // Enable the Quad-SPI unit.
               | (Div << CR_PRESCALER_BIT)
               ;
  QUADSPI_DCR  = 0
               | (1uL           << DCR_CKMODE_BIT)    // CLK signals stays HIGH when the NOR flash is not selected.
               | (DCR_FSIZE_MAX << DCR_FSIZE_BIT)     // We set the NOR flash size to maximum since this value is not known at this stage.
               ;
#if FS_NOR_HW_USE_OS
  //
  // Clear interrupt flags and enable the interrupt.
  //
  QUADSPI_CR  |= 0
              | (1uL << CR_APMS_BIT)
              | (1uL << CR_TRIE_BIT)
              | (1uL << CR_TCIE_BIT)
              | (1uL << CR_SMIE_BIT)
              | (1uL << CR_TOIE_BIT)
              ;
  QUADSPI_FCR  = 0
               | (1uL << SR_SMF_BIT)
               | (1uL << SR_TOF_BIT)
               | (1uL << SR_FTF_BIT)
               | (1uL << SR_TCF_BIT)
               | (1uL << SR_TEF_BIT)
               ;
  _StatusQSPI = 0;
  NVIC_EnableIRQ(QUADSPI_IRQn);
#if FS_NOR_HW_USE_DMA
  NVIC_EnableIRQ(DMA2_Channel7_IRQn);
#endif // FS_NOR_HW_USE_DMA
#endif // FS_NOR_HW_USE_OS
  return (int)Freq_Hz;
}

/*********************************************************************
*
*       _HW_SetCmdMode
*
*  Function description
*    HW layer function. It enables the direct access to NOR flash via SPI.
*    This function disables the memory-mapped mode.
*/
static void _HW_SetCmdMode(U8 Unit) {
  FS_USE_PARA(Unit);            // This device has only one HW unit.

  //
  // Cancel the memory mode so that the BUSY bit goes to 0
  // and we can write to QUADSPI_CCR register.
  //
  if ((QUADSPI_CCR & (CCR_FMODE_MASK << CCR_FMODE_BIT)) == (CCR_FMODE_MMAP << CCR_FMODE_BIT)) {
    _Cancel();
  }
}

/*********************************************************************
*
*       _HW_SetMemMode
*
*  Function description
*    HW layer function. It enables the memory-mapped mode. In this mode
*    the data can be accessed by doing read operations from memory.
*    The HW is responsible to transfer the data via SPI.
*    This function disables the direct access to NOR flash via SPI.
*/
static void _HW_SetMemMode(U8 Unit, U8 ReadCmd, unsigned NumBytesAddr, unsigned NumBytesDummy, U16 BusWidth) {
  U32 CfgReg;
  U32 CmdMode;
  U32 AddrMode;
  U32 DataMode;
  U32 NumCyclesDummy;
  U32 AddrSize;

  FS_USE_PARA(Unit);            // This device has only one HW unit.
  AddrSize = 0;
  if (NumBytesAddr) {
     AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  NumCyclesDummy = _GetNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesDummy);  // The dummy bytes are sent using the data mode.
  CmdMode        = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(ReadCmd));
  AddrMode       = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  DataMode       = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), 1);                   // We read at least one byte.
  CfgReg = 0
         | (CCR_FMODE_MMAP << CCR_FMODE_BIT)
         | (DataMode       << CCR_DMODE_BIT)
         | (AddrSize       << CCR_ADSIZE_BIT)
         | (NumCyclesDummy << CCR_DCYC_BIT)
         | (AddrMode       << CCR_ADMODE_BIT)
         | (CmdMode        << CCR_IMODE_BIT)
         | (ReadCmd        << CCR_INTRUCTION_BIT)
         ;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((QUADSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
  _ClearFlags();
  QUADSPI_AR  = 0;
  QUADSPI_CCR = CfgReg;
}

/*********************************************************************
*
*       _HW_ExecCmd
*
*  Function description
*    HW layer function. It requests the NOR flash to execute a simple command.
*    The HW has to be in SPI mode.
*/
static void _HW_ExecCmd(U8 Unit, U8 Cmd, U8 BusWidth) {
  U32 CfgReg;
  U32 CmdMode;

